#Inline CSS მოიცავს სტილის გამოყენებას პირდაპირ HTML ელემენტში სტილის ატრიბუტის გამოყენებით.
#გამოსადეგია სტილის სწრაფი, ერთჯერადი ცვლილებებისთვის ან სტილის ტესტირებისთვის პირდაპირ HTML-ში.

#Internal CSS
#Internal css-ით ჩვენ შეგვიძლია header-ში ჩავწეროტ სასურველი თეგის სახელი და მივცეთ სტილი დადებითი მხარე ისაა რომ შეგვიძლია მხოლოდ ერთი წინადადების დაწერით შევუცვალოტ ყველა სასურველ თეგს სტილი.
#external css
#external css-ით შეგვიძლია დავწეროთ html-ის ფაილში კოდი და css-ის ფაილში შევუცვალოთ სტილი
